import pandas as pd
import pytest

from src.services import get_profitable_categories


@pytest.mark.parametrize(
    "data, result",
    [
        (
                pd.DataFrame({
                    'Номер карты': ['*3456', '*0001', '*4444', '*3456'],
                    'Сумма операции': [100, 200, 300, 150],
                    'Кэшбэк': [5, 10, 15, 7],
                    'Дата операции': ['12.12.2021 12:00:00', '13.12.2021 12:00:00', '14.12.2021 12:00:00',
                                      '15.12.2021 12:00:00'],
                    'Сумма платежа': [100, 200, 300, 150],
                    'Категория': ['Еда', 'Транспорт', 'Развлечения', 'Покупки'],
                    'Описание': ['Ресторан', 'Такси', 'Кино', 'Магазин']
                }),
                '{"Еда": 5, "Транспорт": 10, "Развлечения": 15}'
        ),
        (
                pd.DataFrame({
                    'Дата операции': ['01.11.2021 12:00:00', '02.11.2021 01:00:00'],
                    'Кэшбэк': [20, 30],
                    'Категория': ['Развлечения', 'Транспорт']
                }),
                '{"Транспорт": 30, "Развлечения": 20}'
        )
    ]
)
def test_profitable_categories(data, result):
    result = get_profitable_categories(data, "2021", "12")
    assert result == result
